# my_config.py
import torch

# ===============================
# 模型参数
# ===============================
INPUT_DIM = 14      # 对应新模型的 input_dim
NUM_CLASSES = 8     # 8分类
SEQ_LEN = 50        # 时间窗口长度

# ===============================
# 训练参数
# ===============================
BATCH_SIZE = 256
EPOCHS = 60         #  增加到 30：
# 修改这两个参数
LR = 0.001         # 从 0.001 降为 3e-4 (深度学习炼丹黄金学习率)
WEIGHT_DECAY = 1e-4  # 稍微加大正则化，约束模型不要“走极端”

# ===============================
# 设备
# ===============================
DEVICE = torch.device("cuda" if torch.cuda.is_available() else "cpu")
